package database;

public class DatabaseDefaultInfo {

	//사업자 정보
	String[] compUserId = {"company01","company02","company03","company04","company05"};
	String[] coUserPass = {"company01!!","company02!!","company03!!","company04!!","company05!!"};
	String[] coUserName = {"전지현","한선화","정소민","이수근","유재석"};
	String[] coUserPhone = {"01012345678","01088556752","01077683544","01099658321","01098751313"};
	int[] compUserType = {2,2,2,2,2};
	
	//업체 정보
	String[] coUserId = compUserId;
	String[] coName = {"하이렌터카","굿모닝렌터카","한마음렌터카","메머드렌터카","대덕렌터카"};
	String[] coTel = {"022451234","0427856495","0426634256","0543268521","0542481982"};
	String[] coAddr = {"서울 노원구 상대동 28번지","대전 서구 갈마동 77-66번지","대전 동구 용전동 대덕대로 29길 5","경북 포항시 북구 삼호로 221","경북 포항시 남구 송도동 20-23번지 "};
	String[] coNum = {"1928475638","3927468271","8483736213","4685235235","9377185628"};
	String[] coSerialNum = {"202001291928475638","202001293927468271","202001298483736213","202001294685235235","2020129179377185628"};
	
	//업체별 정보
	//업체 1
	String[] compSerialNum1 = {coSerialNum[0],coSerialNum[0],coSerialNum[0],coSerialNum[0],coSerialNum[0],coSerialNum[0],coSerialNum[0],coSerialNum[0],coSerialNum[0],coSerialNum[0]};
	String[] compVSeries1 = {"소형","소형","준중형","준중형","준중형","중형","중형","고급형","SUV","고급형"};
	String[] compVName1 = 	{"모닝","클리오","아반떼","아반떼","SM3","K5","소나타","제네시스","티볼리","K9"};
	String[] compVNum1 = {"23호2837","36하2458","30허3764","52하2635","68허7556","85호2483","14하2095","76하4357","64허6875","49호2567"};
	int[] compRentPrice1 = {15000,15000,20000,25000,24000,35000,36000,72000,45000,68000};
	
	//업체2
	String[] compSerialNum2 = {coSerialNum[1],coSerialNum[1],coSerialNum[1],coSerialNum[1],coSerialNum[1],coSerialNum[1],coSerialNum[1],coSerialNum[1],coSerialNum[1],coSerialNum[1]};
	String[] compVSeries2 = {"소형","소형","소형","준중형","중형","중형","고급형","고급형","SUV","SUV"};
	String[] compVName2 = 	{"모닝","클리오","모닝","아반떼","말리부","K5","제네시스","알페온","셀토스","티볼리"};
	String[] compVNum2 = {"20허3164","34하3459","67하3856","54하5049","95호5756","65허6548","36하6853","73허4805","77호8650","57허6048"};
	int[] compRentPrice2 = {15000,15000,16000,22000,38000,32000,65000,62000,42000,39000};
	
	//업체3
	String[] compSerialNum3 = {coSerialNum[2],coSerialNum[2],coSerialNum[2],coSerialNum[2],coSerialNum[2],coSerialNum[2],coSerialNum[2],coSerialNum[2],coSerialNum[2],coSerialNum[2]};
	String[] compVSeries3 = {"소형","준중형","준중형","준중형","중형","중형","고급형","고급형","고급형","SUV"};
	String[] compVName3 = 	{"레이","아반떼","아이오닉","K3","K5","i40","k9","임팔라","알페온","티볼리"};
	String[] compVNum3 = {"60하8548","57하6566","64허7354","31호5896","51하9504","94하3875","65허8765","82허5134","67호2495","65호5789"};
	int[] compRentPrice3 = {15000,23000,30000,20000,38000,40000,65000,62000,58000,41000};
	
	//업체4
	String[] compSerialNum4 = {coSerialNum[3],coSerialNum[3],coSerialNum[3],coSerialNum[3],coSerialNum[3],coSerialNum[3],coSerialNum[3],coSerialNum[3],coSerialNum[3],coSerialNum[3]};
	String[] compVSeries4 = {"소형","소형","소형","준중형","준중형","중형","중형","고급형","고급형","SUV"};
	String[] compVName4 = 	{"엑센트","모닝","레이","포르테","크루즈","말리부","스팅어","제네시스","K9","셀토스"};
	String[] compVNum4 = {"67허6730","95하6075","61허5407","48호5721","24호6009","57하8045","65호9042","66하7680","51하5753","84허8354"};
	int[] compRentPrice4 = {15000,15000,17000,22000,24000,32000,36000,66000,60000,72000};
	
	//업체5
	String[] compSerialNum5 = {coSerialNum[4],coSerialNum[4],coSerialNum[4],coSerialNum[4],coSerialNum[4],coSerialNum[4],coSerialNum[4],coSerialNum[4],coSerialNum[4],coSerialNum[4]};
	String[] compVSeries5 = {"소형","소형","소형","준중형","중형","중형","고급형","SUV","SUV","SUV"};
	String[] compVName5 = 	{"스파크","스파크","레이","SM6","스팅어","제네시스","제네시스","셀토스","셀토스","셀토스"};
	String[] compVNum5 = {"93하8453","52허9543","53호7365","34하8065","54호2587","91호4690","36하5762","83호1943","77하6723","31호3048"};
	int[] compRentPrice5 = {14000,18000,14000,24000,36000,36000,66000,72000,70000,60000};
	
	
	//업체차량별 옵션정보
	
	int[][] compOption1 = {{1,1,0,0,1,0,1,1,0,0,0,0,1},
						   {1,1,1,0,0,0,1,1,1,0,0,0,0},
						   {1,1,1,1,1,0,1,0,1,1,0,1,1},
						   {1,1,1,1,0,0,1,1,1,0,0,0,1},
						   {1,1,1,1,1,0,1,1,1,1,0,0,0},
						   {1,1,1,1,1,0,1,0,1,1,1,1,1},
						   {1,1,1,1,1,0,1,0,1,1,1,1,1},
						   {1,1,1,1,1,0,1,1,1,1,1,0,1},
						   {1,1,1,1,1,0,1,1,1,1,1,1,1},
						   {1,1,1,1,1,0,1,0,1,1,1,0,1}};
	int[][] compOption2 = {{1,1,1,1,0,0,1,1,0,1,1,0,0},
						   {1,1,0,1,0,0,0,1,1,1,1,0,1},
						   {1,1,1,0,1,0,1,1,0,0,1,0,0},
						   {1,1,1,1,0,0,0,0,1,1,0,1,1},
						   {1,1,1,1,1,0,1,1,0,1,1,0,1},
						   {1,1,1,1,1,1,1,1,0,0,0,1,0},
						   {1,1,1,0,0,1,0,0,1,1,1,0,1},
						   {1,1,1,1,1,1,1,0,1,0,1,1,1},
						   {1,1,1,1,1,1,1,0,1,1,1,1,1},
						   {1,1,1,0,1,0,1,0,1,1,1,1,1}};
	int[][] compOption3 = {{1,1,1,1,0,0,0,0,1,1,1,0,0},
						   {1,1,0,1,0,0,1,0,1,0,1,1,1},
						   {1,1,1,0,0,0,1,1,1,0,0,1,0},
						   {1,1,1,1,1,0,0,1,0,1,1,1,1},
						   {1,1,0,1,0,0,1,0,1,1,1,0,0},
						   {1,1,1,0,0,0,1,1,1,1,0,1,0},
						   {1,1,1,1,1,0,1,1,1,0,1,1,1},
						   {1,1,1,1,1,0,1,0,1,1,0,1,1},
						   {1,1,1,1,1,0,1,0,1,1,1,0,1},
						   {1,1,1,1,1,0,1,0,1,1,1,1,1}};
	int[][] compOption4 = {{1,1,0,0,1,0,0,0,1,0,1,0,1},
						   {1,1,0,0,1,0,0,1,0,1,0,0,1},
						   {1,1,1,0,1,0,0,1,1,0,0,0,1},
						   {1,1,0,1,1,1,1,0,1,1,1,0,1},
						   {1,1,1,1,1,0,1,0,1,1,0,0,1},
						   {1,1,1,1,1,1,0,1,0,1,1,0,1},
						   {1,1,1,1,1,1,1,1,1,0,1,1,1},
						   {1,1,1,1,1,1,1,0,1,1,1,0,1},
						   {1,1,1,1,1,0,1,1,1,1,1,1,1},
						   {1,1,1,1,1,1,1,0,1,1,1,1,1}};
	int[][] compOption5 = {{1,1,1,0,0,0,1,1,0,0,0,0,0},
						   {1,1,1,0,0,0,1,1,0,0,1,0,1},
						   {1,1,0,1,1,1,1,0,1,1,0,1,0},
						   {1,1,1,0,1,0,1,1,0,0,1,0,0},
						   {1,1,0,1,1,0,1,0,1,1,1,1,1},
						   {1,1,1,0,0,1,1,0,1,1,0,1,1},
						   {1,1,0,1,1,0,1,1,1,0,0,0,1},
						   {1,1,0,0,1,1,1,0,1,1,1,1,1},
						   {1,1,1,0,0,1,1,0,1,1,1,1,1},
						   {1,1,1,1,1,0,1,0,1,1,1,1,1}};


	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}
